fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскаяПлата</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь; 
	
	//++__ВКМ		
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата Тогда 
		
		ВКМ_ДобавлениеРеквезитовНаФорму();
		
	КонецЕсли; 
	//--__ВКМ
	
КонецПроцедуры  

//++__ВКМ
&НаСервере
Процедура ВКМ_ДобавлениеРеквезитовНаФорму()
				
			ЭлементыФормы = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы")); 	  
			ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементыФормы.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
			
			ЭлементыФормы = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы")); 	  
			ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементыФормы.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
			
			ЭлементыФормы = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы")); 	  
			ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементыФормы.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
			
			ЭлементыФормы = Элементы.Добавить("СуммаЧаса", Тип("ПолеФормы")); 	  
			ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементыФормы.ПутьКДанным = "Объект.ВКМ_СуммаЧаса";
		
		КонецПроцедуры
//--__ВКМ		

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
		
	//++__ВКМ
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата") Тогда 
		
		ВКМ_ДобавлениеРеквезитовНаФорму();
		
	КонецЕсли;
	//--__ВКМ
	
КонецПроцедуры
